In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [3]:
data = pd.read_csv('boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [4]:
data.to_sql('boston', con, index=False, if_exists='replace')

506

In [5]:
pd.read_sql(
    '''
    SELECT * FROM boston
    limit 5
    ''',
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [6]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [7]:
tasks+=1
pd.read_sql(
    '''
    SELECT 
    sum(case when CRIM is null then 1 else 0 end) as CRIM_null,
    sum(case when ZN is null then 1 else 0 end) as ZN_null,
    sum(case when INDUS is null then 1 else 0 end) as INDUS_null,
    sum(case when CHAS is null then 1 else 0 end) as CHAS_null,
    sum(case when NOX is null then 1 else 0 end) as NOX_null
    FROM boston
    ''',
    con,
)

   CRIM_null  ZN_null  INDUS_null  CHAS_null  NOX_null
0          0        0           0          0         0

2. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–æ–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [8]:
tasks+=1
pd.read_sql(
    '''
    SELECT
    count(distinct CRIM) as CRIM_uniq,
    count(distinct ZN) as ZN_uniq,
    count(distinct INDUS) as INDUS_uniq,
    count(distinct CHAS) as CHAS_uniq,
    count(distinct NOX) as NOX_uniq
    FROM boston
    ''',
    con,
)

   CRIM_uniq  ZN_uniq  INDUS_uniq  CHAS_uniq  NOX_uniq
0        504       26          76          2        81

3. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –º–µ–¥–∏–∞–Ω–∞ —Ä–∞–≤–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–º—É –∑–Ω–∞—á–µ–Ω–∏—é (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX.
–ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ –¥–∞–Ω–Ω—ã–º –≤ —ç—Ç–∏—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö

In [9]:
tasks+=1
pd.read_sql(
    '''
    SELECT distinct
    case when med_CRIM=min_CRIM THEN 'CRIM' end as CRIM,
    case when med_ZN=min_ZN THEN 'ZN' end as ZN,
    case when med_INDUS=min_INDUS THEN 'INDUS' end as INDUS,
    case when med_CHAS=min_CHAS THEN 'CHAS' end as CHAS,
    case when med_NOX=min_NOX THEN 'NOX' end as NOX
    FROM 
    (SELECT avg(CRIM) as med_CRIM
    FROM (
          SELECT CRIM
          FROM boston
          ORDER BY CRIM asc
          LIMIT 2 - (SELECT count(*) FROM boston)%2
          OFFSET (SELECT (count(*)-1)/2 FROM boston)))
    CROSS JOIN 
    (SELECT avg(ZN) as med_ZN
    FROM (
          SELECT ZN
          FROM boston
          ORDER BY ZN asc
          LIMIT 2 - (SELECT count(*) FROM boston)%2
          OFFSET (SELECT (count(*)-1)/2 FROM boston)))
    CROSS JOIN
    (SELECT avg(INDUS) as med_INDUS
    FROM (
          SELECT INDUS
          FROM boston
          ORDER BY INDUS asc
          LIMIT 2 - (SELECT count(*) FROM boston)%2
          OFFSET (SELECT (count(*)-1)/2 FROM boston)))
    CROSS JOIN
    (SELECT avg(CHAS) as med_CHAS
    FROM (
          SELECT CHAS
          FROM boston
          ORDER BY CHAS asc
          LIMIT 2 - (SELECT count(*) FROM boston)%2
          OFFSET (SELECT (count(*)-1)/2 FROM boston)))
    CROSS JOIN
    (SELECT avg(NOX) as med_NOX
    FROM (
          SELECT NOX
          FROM boston
          ORDER BY NOX asc
          LIMIT 2 - (SELECT count(*) FROM boston)%2
          OFFSET (SELECT (count(*)-1)/2 FROM boston)))
    CROSS JOIN 
    (SELECT min(CRIM) as min_CRIM
    , min(ZN) as min_ZN
    , min(INDUS) as min_INDUS
    , min(CHAS) as min_CHAS
    , min(NOX) as min_NOX
    FROM boston
    )
    WHERE med_ZN= min_ZN
    ''',
    con,
)

   CRIM  ZN INDUS  CHAS   NOX
0  None  ZN  None  CHAS  None

CHAS - 50% –Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π. ZN - 50% —É—á–∞—Å—Ç–∫–æ–≤ —Å–≤—ã—à–µ 25,000 sq.ft, –Ω–µ –∏—Å–ø–æ–ª—å–∑—É—é—Ç—Å—è –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É.

4. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–∑–Ω–∏—Ü—É –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç(RM) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é(MEDV) –∏ 25 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. 
–ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ –ø–æ 50, 100, 200, 300 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. (–∫–æ–ª-–≤–æ –¥–æ–º–æ–≤(25,50,100,200,300), —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –Ω–∏—Ö, —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö, —Ä–∞–∑–Ω–∏—Ü–∞).
–ù–∞–ø–∏—à–∏—Ç–µ –≤–ª–∏—è–µ—Ç –ª–∏ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∏ –∫–∞–∫ —Å–∏–ª—å–Ω–æ.

In [10]:
tasks+=1
pd.read_sql(
    '''
    WITH help_table AS (
         SELECT * FROM
         (SELECT 
          RM
          , MEDV
          , row_number() over (order by MEDV asc) as rn_low
          FROM boston)
          WHERE rn_low <= 300),
         max_houses AS (
          SELECT avg(RM) as RM_high, avg(MEDV) as MEDV_high 
          FROM boston
          WHERE MEDV = (SELECT max(MEDV) FROM boston)
         )
    SELECT *
    , (diff_price /
        last_value(diff_price) over (ORDER BY diff_price desc ROWS BETWEEN CURRENT
           ROW AND 1 FOLLOWING) - 1)*100 as f
    FROM (     
            SELECT 
            25 as houses,
            RM_high,
            avg(RM) as RM_low,
            RM_high - avg(RM) as diff,
            MEDV_high - avg(MEDV) as diff_price
            FROM help_table t1
            CROSS JOIN max_houses t2
            WHERE rn_low <= 25
        UNION ALL
            SELECT 
            50,
            RM_high,
            avg(RM) as RM_low,
            RM_high - avg(RM) as diff,
            MEDV_high - avg(MEDV) as diff_price
            FROM help_table t1
            CROSS JOIN max_houses t2
            WHERE rn_low <= 50
        UNION ALL
            SELECT 
            100,
            RM_high,
            avg(RM) as RM_low,
            RM_high - avg(RM) as diff,
            MEDV_high - avg(MEDV) as diff_price
            FROM help_table t1
            CROSS JOIN max_houses t2
            WHERE rn_low <= 100
        UNION ALL
            SELECT 
            200,
            RM_high,
            avg(RM) as RM_low,
            RM_high - avg(RM) as diff,
            MEDV_high - avg(MEDV) as diff_price
            FROM help_table t1
            CROSS JOIN max_houses t2
            WHERE rn_low <= 200
        UNION ALL
            SELECT 
            300,
            RM_high,
            avg(RM) as RM_low,
            RM_high - avg(RM) as diff,
            MEDV_high - avg(MEDV) as diff_price
            FROM help_table t1
            CROSS JOIN max_houses t2
            WHERE rn_low <= 300)
    ''',
    con,
)

   houses  RM_high    RM_low      diff  diff_price         f
0      25    7.484  5.747840  1.736160   42.152000  4.465923
1      50    7.484  5.753240  1.730760   40.350000  5.675301
2     100    7.484  5.887120  1.596880   38.183000  8.605561
3     200    7.484  5.911705  1.572295   35.157500  6.304867
4     300    7.484  5.972227  1.511773   33.072333  0.000000

–î–∞, –≤–ª—è–∏—è–µ—Ç, —á–µ–º –¥–æ—Ä–æ–∂–µ –¥–æ–º–∞, —Ç–µ–º –º–µ–Ω–µ–µ –æ–Ω–∏ –æ—Ç–ª–∏—á–∞—é—Ç—Å—è –æ—Ç –¥–æ—Ä–æ–≥–∏—Ö –¥–æ–º–æ–≤ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∫–æ–º–Ω–∞—Ç. –†–∞–∑–Ω–∏—Ü–∞ –≤ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –∫–æ–ª–µ–±–ª–µ—Ç—Å—è –º–µ–∂–¥—É –¥–æ—Ä–æ–≥–∏–º–∏ –∏ –¥–µ—à—ë–≤—ã–º–∏ –¥–æ–º–∞–º–∏ –∫–æ–ª–µ–±–ª–µ—Ç—Å—è –≤ —Ä–∞–∑—Ä–µ–∑–µ 4-8%.

5. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–Ω–≥–∏ –∑–Ω–∞—á–µ–Ω–∏–π –∫–æ–ª–æ–Ω–∫–∏ LSTAT(–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é (–∑–Ω–∞—á–µ–Ω–∏–µ LSTAT, —Å—Ç–æ–∏–º–æ—Å—Ç—å, —Ä–∞–Ω–≥) —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –∑–Ω–∞—á–µ–Ω–∏–π LSTAT. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [11]:
tasks+=1
pd.read_sql(
    '''
WITH rank_r AS (
         SELECT LSTAT as LSTAT_among_r, MEDV as MEDV_among_r, rank() over (order by LSTAT) as rank_r
         FROM (
          SELECT *
          FROM boston
          WHERE MEDV = (SELECT max(MEDV) FROM boston))),
    rank_a AS (
         SELECT LSTAT as LSTAT_among_a, MEDV as MEDV_among_a, rank() over (order by LSTAT) as rank_a
         FROM boston)
    SELECT LSTAT_among_a as LSTAT, rank_a, rank_r, MEDV_among_r as MEDV
    FROM rank_a t1
    INNER JOIN rank_r t2 ON t1.LSTAT_among_a=t2.LSTAT_among_r AND t1.MEDV_among_a=t2.MEDV_among_r
    ''',
    con,
)

    LSTAT  rank_a  rank_r  MEDV
0    1.73       1       1  50.0
1    1.92       2       2  50.0
2    2.88       6       3  50.0
3    2.96       8       4  50.0
4    2.97       9       5  50.0
5    3.16      15       6  50.0
6    3.26      17       7  50.0
7    3.32      18       8  50.0
8    3.70      26       9  50.0
9    3.73      27      10  50.0
10   4.45      41      11  50.0
11   4.63      50      12  50.0
12   5.12      67      13  50.0
13   7.44     141      14  50.0
14   8.88     181      15  50.0
15   9.53     203      16  50.0

–°–∞–º—ã–µ –¥–æ—Ä–æ–≥–∏–µ –¥–æ–º–∞ –Ω–µ –≥–∞—Ä–∞–Ω—Ç–∏—Ä—É—é—Ç –±–æ–ª–µ–µ –ø—Ä–µ—Å—Ç–∏–∂–Ω—ã–π —Ä–∞–π–æ–Ω.

6. –í—ã–≤–µ–¥–∏—Ç–µ —Å—Ä–µ–¥–Ω—é—é —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π(CHAS) –∏ –Ω–µ—Ç (–≥—Ä–∞–Ω–∏—á–∏—Ç/–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç, —Å—Ç–æ–∏–º–æ—Å—Ç—å)

In [12]:
tasks+=1
pd.read_sql(
    '''
    SELECT 
    case when CHAS=0 then '–≥—Ä–∞–Ω–∏—á–∏—Ç' else '–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç' end as chas,
    avg(MEDV) as avg_MEDV
    FROM boston
    GROUP BY CHAS
    ''',
    con,
)

          chas   avg_MEDV
0     –≥—Ä–∞–Ω–∏—á–∏—Ç  22.093843
1  –Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç  28.440000

7. –í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –≤—ã—à–µ, –∫–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [13]:
tasks+=1
pd.read_sql(
    '''
    SELECT max(CRIM), max(ZN), max(INDUS), max(CHAS), max(NOX)
    FROM (
    SELECT
    CASE WHEN first_value(avg_CRIM) over (ORDER BY CHAS asc) > avg_CRIM THEN 'CRIM' END as CRIM,
    CASE WHEN first_value(avg_ZN) over (ORDER BY CHAS asc) > avg_ZN THEN 'ZN' END as ZN,
    CASE WHEN first_value(avg_INDUS) over (ORDER BY CHAS asc) > avg_INDUS THEN 'INDUS' END as INDUS,
    CASE WHEN first_value(avg_CHAS) over (ORDER BY CHAS asc) > avg_CHAS THEN 'CHAS' END as CHAS,
    CASE WHEN first_value(avg_NOX) over (ORDER BY CHAS asc) > avg_NOX THEN 'NOX' END as NOX
    FROM (
    SELECT CHAS, avg(CRIM) as avg_CRIM, avg(ZN) as avg_ZN, avg(INDUS) as avg_INDUS, avg(CHAS) as avg_CHAS, avg(NOX) as avg_NOX
    FROM boston
    GROUP BY CHAS))
    ''',
    con,
)

  max(CRIM) max(ZN) max(INDUS) max(CHAS) max(NOX)
0      CRIM      ZN       None      None     None

–†—è–¥–æ–º —Å —Ä–µ–∫–∞–º–∏ —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –≤—ã—à–µ –∏ –≤ —Å—Ä–µ–¥–Ω–µ–º –¥–æ–ª—è –±–æ–ª—å—à–µ –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.

8. –í—ã–≤–µ–¥–∏—Ç–µ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS), –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –∏ –ø–æ –∏—Ö –ø–µ—Ä—Ü–µ–Ω—Ç–∏–ª—è–º - 10, 20 ... 100 ( –ø–µ—Ä—Ü–µ—Ç–∏–ª—å(10,20...100),–∑–Ω–∞—á–µ–Ω–∏–µ INDUS, –∑–Ω–∞—á–µ–Ω–∏–µ NOX). –ù–∞–ø–∏—à–∏—Ç–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –º–µ–∂–¥—É –Ω–∏–º–∏ –≤–∑–∞–∏–º–æ—Å–≤—è–∑—å

In [14]:
tasks+=1
pd.read_sql(
    '''
    SELECT
    perc_indus, max(perc_nox), min(perc_nox)
    FROM
    (SELECT
    INDUS
    , NOX
    , NTILE(10) OVER (ORDER BY INDUS asc) * 10 as perc_indus
    , NTILE(10) OVER (ORDER BY NOX asc) * 10 as perc_nox
    FROM boston)
    GROUP BY perc_indus
    ORDER BY perc_indus asc
    ''',
    con,
)

   perc_indus  max(perc_nox)  min(perc_nox)
0          10             50             10
1          20             80             10
2          30             50             10
3          40             50             10
4          50             70             40
5          60             70             10
6          70             80             20
7          80             90             80
8          90            100             70
9         100            100             70

–ü—Ä–∏ –∑–Ω–∞—á–∏—Ç–µ–ª—å–Ω–æ–π –∏–Ω–¥—É—Å—Ç—Ä–∏–∞–ª–∏–∑–∞—Ü–∏–∏, –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ —Ç–∞–∫–∂–µ –Ω–∞—Ö–æ–¥–∏—Ç—Å—è –Ω–∞ –≤—ã—Å–æ–∫–æ–º —É—Ä–æ–≤–Ω–µ.

CRIM - —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –Ω–∞ –¥—É—à—É –Ω–∞—Å–µ–ª–µ–Ω–∏—è
ZN - –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.
INDUS - –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –Ω–∞ –≥–æ—Ä–æ–¥.
CHAS - 1, –µ—Å–ª–∏ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, 0 –∏–Ω–∞—á–µ
NOX - –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ (—á–∞—Å—Ç–µ–π –Ω–∞ 10 –º–∏–ª–ª–∏–æ–Ω–æ–≤)
RM - —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –∫–≤–∞—Ä—Ç–∏—Ä–µ
AGE - –¥–æ–ª—è –∂–∏–ª—ã—Ö –¥–æ–º–æ–≤, –ø–æ—Å—Ç—Ä–æ–µ–Ω–Ω—ã—Ö –¥–æ 1940 –≥.
DIS - –≤–∑–≤–µ—à–µ–Ω–Ω—ã–µ —Ä–∞—Å—Å—Ç–æ—è–Ω–∏—è –¥–æ –ø—è—Ç–∏ —Ü–µ–Ω—Ç—Ä–æ–≤ –∑–∞–Ω—è—Ç–æ—Å—Ç–∏ –ë–æ—Å—Ç–æ–Ω–∞
RAD - –∏–Ω–¥–µ–∫—Å –¥–æ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –∫ —Ä–∞–¥–∏–∞–ª—å–Ω—ã–º –º–∞–≥–∏—Å—Ç—Ä–∞–ª—è–º
TAX - –ø–æ–ª–Ω–∞—è —Å—Ç–∞–≤–∫–∞ –Ω–∞–ª–æ–≥–∞ –Ω–∞ –∏–º—É—â–µ—Å—Ç–≤–æ –∑–∞ 10 000 –¥–æ–ª–ª–∞—Ä–æ–≤ –°–®–ê
PTRATIO - —Å–æ–æ—Ç–Ω–æ—à–µ–Ω–∏–µ —É—á–µ–Ω–∏–∫–æ–≤ –∏ —É—á–∏—Ç–µ–ª–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
B - 1000(Bk - 0.63)^2, –≥–¥–µ Bk –¥–æ–ª—è —á–µ—Ä–Ω–æ–∫–æ–∂–∏—Ö –ª—é–¥–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
LSTAT - % –±–æ–ª–µ–µ –Ω–∏–∑–∫–æ–≥–æ —Å—Ç–∞—Ç—É—Å–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è
MEDV - –°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≤ 1000 –¥–æ–ª–ª–∞—Ä–æ–≤.

In [15]:
if tasks==8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ